app/views/site/studentFilterSelection.html.haml

SELECT "cats".* FROM "cats"
---
      {
        $.ajax({
          url: "/site/receiveAjax",
          data: {
              id: s.id,
              c_name: $("#".concat(s.id," option:selected")).text()
          },
          dataType: "json",
          success: function(data){
            var number = s.id.match(/\d+/)[0];
            var dropDown = document.getElementById("filterValue_".concat(number.toString()));
            dropDown.options.length = 0;
            var vec = JSON.parse(data["value"])

            for(var i = 0; i < vec.length; i++)
            {
              var option = document.createElement("option");
              option.text = vec[i];
              dropDown.add(option);
            }
          },
          failure: function(response){