app/controllers/spreadsheets_controller.rb

  def create

      @spreadsheet = Spreadsheet.new(spreadsheet_params)

      ###### call parse_csv with the path to csv file

      saved = @spreadsheet.saveAndMove
---
INSERT INTO "spreadsheets" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "yolo"], ["attachment", "probs.txt"], ["created_at", "2016-04-18 04:54:42.680117"], ["updated_at", "2016-04-18 04:54:42.680117"]]